Revit 2015 API
IExportContext Interface
 An interface that is used in custom export to process a Revit model. An instance of this class is passed in as a parameter of a CustomExporter. The methods herein are then called at times of exporting entities of the model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public interface IExportContext
Visual Basic
Public Interface IExportContext
Visual C++
public interface class IExportContext
See Also
IExportContext Members
Autodesk.Revit.DB Namespace